pjpfxq/Infineon_Mcal/Src/Infra_Prod/Sfr/TC32xA/_Reg/IfxGtm_bf.h
/** \brief Mask for Ifx_GTM_IRQ_NOTIFY_Bits.AEI_TO_XPT */
#define IFX_GTM_IRQ_NOTIFY_AEI_TO_XPT_MSK (0x1u)

/** \brief Offset for Ifx_GTM_IRQ_NOTIFY_Bits.AEI_TO_XPT */
#define IFX_GTM_IRQ_NOTIFY_AEI_TO_XPT_OFF (0u)

/** \brief Length for Ifx_GTM_IRQ_NOTIFY_Bits.AEI_USP_ADDR */
#define IFX_GTM_IRQ_NOTIFY_AEI_USP_ADDR_LEN (1u)

/** \brief Mask for Ifx_GTM_IRQ_NOTIFY_Bits.AEI_USP_ADDR */
#define IFX_GTM_IRQ_NOTIFY_AEI_USP_ADDR_MSK (0x1u)

/** \brief Offset for Ifx_GTM_IRQ_NOTIFY_Bits.AEI_USP_ADDR */
#define IFX_GTM_IRQ_NOTIFY_AEI_USP_ADDR_OFF (1u)

/** \brief Length for Ifx_GTM_IRQ_NOTIFY_Bits.AEI_IM_ADDR */
#define IFX_GTM_IRQ_NOTIFY_AEI_IM_ADDR_LEN (1u)

/** \brief Mask for Ifx_GTM_IRQ_NOTIFY_Bits.AEI_IM_ADDR */
#define IFX_GTM_IRQ_NOTIFY_AEI_IM_ADDR_MSK (0x1u)

/** \brief Offset for Ifx_GTM_IRQ_NOTIFY_Bits.AEI_IM_ADDR */
#define IFX_GTM_IRQ_NOTIFY_AEI_IM_ADDR_OFF (2u)

/** \brief Length for Ifx_GTM_IRQ_NOTIFY_Bits.AEI_USP_BE */
#define IFX_GTM_IRQ_NOTIFY_AEI_USP_BE_LEN (1u)

/** \brief Mask for Ifx_GTM_IRQ_NOTIFY_Bits.AEI_USP_BE */
#define IFX_GTM_IRQ_NOTIFY_AEI_USP_BE_MSK (0x1u)

/** \brief Offset for Ifx_GTM_IRQ_NOTIFY_Bits.AEI_USP_BE */
#define IFX_GTM_IRQ_NOTIFY_AEI_USP_BE_OFF (3u)

/** \brief Length for Ifx_GTM_IRQ_NOTIFY_Bits.AEIM_USP_ADDR */
#define IFX_GTM_IRQ_NOTIFY_AEIM_USP_ADDR_LEN (1u)

/** \brief Mask for Ifx_GTM_IRQ_NOTIFY_Bits.AEIM_USP_ADDR */
#define IFX_GTM_IRQ_NOTIFY_AEIM_USP_ADDR_MSK (0x1u)

/** \brief Offset for Ifx_GTM_IRQ_NOTIFY_Bits.AEIM_USP_ADDR */
#define IFX_GTM_IRQ_NOTIFY_AEIM_USP_ADDR_OFF (4u)

/** \brief Length for Ifx_GTM_IRQ_NOTIFY_Bits.AEIM_IM_ADDR */
#define IFX_GTM_IRQ_NOTIFY_AEIM_IM_ADDR_LEN (1u)

/** \brief Mask for Ifx_GTM_IRQ_NOTIFY_Bits.AEIM_IM_ADDR */
#define IFX_GTM_IRQ_NOTIFY_AEIM_IM_ADDR_MSK (0x1u)

/** \brief Offset for Ifx_GTM_IRQ_NOTIFY_Bits.AEIM_IM_ADDR */
#define IFX_GTM_IRQ_NOTIFY_AEIM_IM_ADDR_OFF (5u)

/** \brief Length for Ifx_GTM_IRQ_NOTIFY_Bits.AEIM_USP_BE */
#define IFX_GTM_IRQ_NOTIFY_AEIM_USP_BE_LEN (1u)

/** \brief Mask for Ifx_GTM_IRQ_NOTIFY_Bits.AEIM_USP_BE */
#define IFX_GTM_IRQ_NOTIFY_AEIM_USP_BE_MSK (0x1u)

/** \brief Offset for Ifx_GTM_IRQ_NOTIFY_Bits.AEIM_USP_BE */
#define IFX_GTM_IRQ_NOTIFY_AEIM_USP_BE_OFF (6u)

/** \brief Length for Ifx_GTM_IRQ_NOTIFY_Bits.CLK_EN_ERR */
#define IFX_GTM_IRQ_NOTIFY_CLK_EN_ERR_LEN (1u)

/** \brief Mask for Ifx_GTM_IRQ_NOTIFY_Bits.CLK_EN_ERR */
#define IFX_GTM_IRQ_NOTIFY_CLK_EN_ERR_MSK (0x1u)

/** \brief Offset for Ifx_GTM_IRQ_NOTIFY_Bits.CLK_EN_ERR */
#define IFX_GTM_IRQ_NOTIFY_CLK_EN_ERR_OFF (7u)

/** \brief Length for Ifx_GTM_IRQ_NOTIFY_Bits.CLK_PER_ERR */
#define IFX_GTM_IRQ_NOTIFY_CLK_PER_ERR_LEN (1u)

/** \brief Mask for Ifx_GTM_IRQ_NOTIFY_Bits.CLK_PER_ERR */
#define IFX_GTM_IRQ_NOTIFY_CLK_PER_ERR_MSK (0x1u)

/** \brief Offset for Ifx_GTM_IRQ_NOTIFY_Bits.CLK_PER_ERR */
#define IFX_GTM_IRQ_NOTIFY_CLK_PER_ERR_OFF (8u)

/** \brief Length for Ifx_GTM_IRQ_NOTIFY_Bits.CLK_EN_ERR_STATE0 */
#define IFX_GTM_IRQ_NOTIFY_CLK_EN_ERR_STATE0_LEN (1u)

/** \brief Mask for Ifx_GTM_IRQ_NOTIFY_Bits.CLK_EN_ERR_STATE0 */
#define IFX_GTM_IRQ_NOTIFY_CLK_EN_ERR_STATE0_MSK (0x1u)

/** \brief Offset for Ifx_GTM_IRQ_NOTIFY_Bits.CLK_EN_ERR_STATE0 */
#define IFX_GTM_IRQ_NOTIFY_CLK_EN_ERR_STATE0_OFF (24u)

/** \brief Length for Ifx_GTM_IRQ_NOTIFY_Bits.CLK_EN_ERR_STATE1 */
#define IFX_GTM_IRQ_NOTIFY_CLK_EN_ERR_STATE1_LEN (1u)

/** \brief Mask for Ifx_GTM_IRQ_NOTIFY_Bits.CLK_EN_ERR_STATE1 */
#define IFX_GTM_IRQ_NOTIFY_CLK_EN_ERR_STATE1_MSK (0x1u)

/** \brief Offset for Ifx_GTM_IRQ_NOTIFY_Bits.CLK_EN_ERR_STATE1 */
#define IFX_GTM_IRQ_NOTIFY_CLK_EN_ERR_STATE1_OFF (25u)

/** \brief Length for Ifx_GTM_IRQ_NOTIFY_Bits.CLK_EN_EXP_STATE0 */
#define IFX_GTM_IRQ_NOTIFY_CLK_EN_EXP_STATE0_LEN (1u)

/** \brief Mask for Ifx_GTM_IRQ_NOTIFY_Bits.CLK_EN_EXP_STATE0 */
#define IFX_GTM_IRQ_NOTIFY_CLK_EN_EXP_STATE0_MSK (0x1u)

/** \brief Offset for Ifx_GTM_IRQ_NOTIFY_Bits.CLK_EN_EXP_STATE0 */
#define IFX_GTM_IRQ_NOTIFY_CLK_EN_EXP_STATE0_OFF (28u)

/** \brief Length for Ifx_GTM_IRQ_NOTIFY_Bits.CLK_EN_EXP_STATE1 */
#define IFX_GTM_IRQ_NOTIFY_CLK_EN_EXP_STATE1_LEN (1u)

/** \brief Mask for Ifx_GTM_IRQ_NOTIFY_Bits.CLK_EN_EXP_STATE1 */
#define IFX_GTM_IRQ_NOTIFY_CLK_EN_EXP_STATE1_MSK (0x1u)

/** \brief Offset for Ifx_GTM_IRQ_NOTIFY_Bits.CLK_EN_EXP_STATE1 */
#define IFX_GTM_IRQ_NOTIFY_CLK_EN_EXP_STATE1_OFF (29u)

/** \brief Length for Ifx_GTM_IRQ_EN_Bits.AEI_TO_XPT_IRQ_EN */
#define IFX_GTM_IRQ_EN_AEI_TO_XPT_IRQ_EN_LEN (1u)

/** \brief Mask for Ifx_GTM_IRQ_EN_Bits.AEI_TO_XPT_IRQ_EN */
#define IFX_GTM_IRQ_EN_AEI_TO_XPT_IRQ_EN_MSK (0x1u)

/** \brief Offset for Ifx_GTM_IRQ_EN_Bits.AEI_TO_XPT_IRQ_EN */
#define IFX_GTM_IRQ_EN_AEI_TO_XPT_IRQ_EN_OFF (0u)

/** \brief Length for Ifx_GTM_IRQ_EN_Bits.AEI_USP_ADDR_IRQ_EN */
#define IFX_GTM_IRQ_EN_AEI_USP_ADDR_IRQ_EN_LEN (1u)

/** \brief Mask for Ifx_GTM_IRQ_EN_Bits.AEI_USP_ADDR_IRQ_EN */
#define IFX_GTM_IRQ_EN_AEI_USP_ADDR_IRQ_EN_MSK (0x1u)

/** \brief Offset for Ifx_GTM_IRQ_EN_Bits.AEI_USP_ADDR_IRQ_EN */
#define IFX_GTM_IRQ_EN_AEI_USP_ADDR_IRQ_EN_OFF (1u)

/** \brief Length for Ifx_GTM_IRQ_EN_Bits.AEI_IM_ADDR_IRQ_EN */
#define IFX_GTM_IRQ_EN_AEI_IM_ADDR_IRQ_EN_LEN (1u)

/** \brief Mask for Ifx_GTM_IRQ_EN_Bits.AEI_IM_ADDR_IRQ_EN */
#define IFX_GTM_IRQ_EN_AEI_IM_ADDR_IRQ_EN_MSK (0x1u)

/** \brief Offset for Ifx_GTM_IRQ_EN_Bits.AEI_IM_ADDR_IRQ_EN */
#define IFX_GTM_IRQ_EN_AEI_IM_ADDR_IRQ_EN_OFF (2u)

/** \brief Length for Ifx_GTM_IRQ_EN_Bits.AEI_USP_BE_IRQ_EN */
#define IFX_GTM_IRQ_EN_AEI_USP_BE_IRQ_EN_LEN (1u)

/** \brief Mask for Ifx_GTM_IRQ_EN_Bits.AEI_USP_BE_IRQ_EN */
#define IFX_GTM_IRQ_EN_AEI_USP_BE_IRQ_EN_MSK (0x1u)

/** \brief Offset for Ifx_GTM_IRQ_EN_Bits.AEI_USP_BE_IRQ_EN */
#define IFX_GTM_IRQ_EN_AEI_USP_BE_IRQ_EN_OFF (3u)

/** \brief Length for Ifx_GTM_IRQ_EN_Bits.AEIM_USP_ADDR_IRQ_EN */
#define IFX_GTM_IRQ_EN_AEIM_USP_ADDR_IRQ_EN_LEN (1u)

/** \brief Mask for Ifx_GTM_IRQ_EN_Bits.AEIM_USP_ADDR_IRQ_EN */
#define IFX_GTM_IRQ_EN_AEIM_USP_ADDR_IRQ_EN_MSK (0x1u)

/** \brief Offset for Ifx_GTM_IRQ_EN_Bits.AEIM_USP_ADDR_IRQ_EN */
#define IFX_GTM_IRQ_EN_AEIM_USP_ADDR_IRQ_EN_OFF (4u)

/** \brief Length for Ifx_GTM_IRQ_EN_Bits.AEIM_IM_ADDR_IRQ_EN */
#define IFX_GTM_IRQ_EN_AEIM_IM_ADDR_IRQ_EN_LEN (1u)

/** \brief Mask for Ifx_GTM_IRQ_EN_Bits.AEIM_IM_ADDR_IRQ_EN */
#define IFX_GTM_IRQ_EN_AEIM_IM_ADDR_IRQ_EN_MSK (0x1u)

