pjpfxq/Infineon_Mcal/Src/Infra_Prod/Sfr/TC32xA/_Reg/IfxGtm_bf.h
/** \brief Mask for Ifx_GTM_CMP_IRQ_NOTIFY_Bits.TBWC1 */
#define IFX_GTM_CMP_IRQ_NOTIFY_TBWC1_MSK (0x1u)

/** \brief Offset for Ifx_GTM_CMP_IRQ_NOTIFY_Bits.TBWC1 */
#define IFX_GTM_CMP_IRQ_NOTIFY_TBWC1_OFF (13u)

/** \brief Length for Ifx_GTM_CMP_IRQ_NOTIFY_Bits.TBWC2 */
#define IFX_GTM_CMP_IRQ_NOTIFY_TBWC2_LEN (1u)

/** \brief Mask for Ifx_GTM_CMP_IRQ_NOTIFY_Bits.TBWC2 */
#define IFX_GTM_CMP_IRQ_NOTIFY_TBWC2_MSK (0x1u)

/** \brief Offset for Ifx_GTM_CMP_IRQ_NOTIFY_Bits.TBWC2 */
#define IFX_GTM_CMP_IRQ_NOTIFY_TBWC2_OFF (14u)

/** \brief Length for Ifx_GTM_CMP_IRQ_NOTIFY_Bits.TBWC3 */
#define IFX_GTM_CMP_IRQ_NOTIFY_TBWC3_LEN (1u)

/** \brief Mask for Ifx_GTM_CMP_IRQ_NOTIFY_Bits.TBWC3 */
#define IFX_GTM_CMP_IRQ_NOTIFY_TBWC3_MSK (0x1u)

/** \brief Offset for Ifx_GTM_CMP_IRQ_NOTIFY_Bits.TBWC3 */
#define IFX_GTM_CMP_IRQ_NOTIFY_TBWC3_OFF (15u)

/** \brief Length for Ifx_GTM_CMP_IRQ_NOTIFY_Bits.TBWC4 */
#define IFX_GTM_CMP_IRQ_NOTIFY_TBWC4_LEN (1u)

/** \brief Mask for Ifx_GTM_CMP_IRQ_NOTIFY_Bits.TBWC4 */
#define IFX_GTM_CMP_IRQ_NOTIFY_TBWC4_MSK (0x1u)

/** \brief Offset for Ifx_GTM_CMP_IRQ_NOTIFY_Bits.TBWC4 */
#define IFX_GTM_CMP_IRQ_NOTIFY_TBWC4_OFF (16u)

/** \brief Length for Ifx_GTM_CMP_IRQ_NOTIFY_Bits.TBWC5 */
#define IFX_GTM_CMP_IRQ_NOTIFY_TBWC5_LEN (1u)

/** \brief Mask for Ifx_GTM_CMP_IRQ_NOTIFY_Bits.TBWC5 */
#define IFX_GTM_CMP_IRQ_NOTIFY_TBWC5_MSK (0x1u)

/** \brief Offset for Ifx_GTM_CMP_IRQ_NOTIFY_Bits.TBWC5 */
#define IFX_GTM_CMP_IRQ_NOTIFY_TBWC5_OFF (17u)

/** \brief Length for Ifx_GTM_CMP_IRQ_NOTIFY_Bits.TBWC6 */
#define IFX_GTM_CMP_IRQ_NOTIFY_TBWC6_LEN (1u)

/** \brief Mask for Ifx_GTM_CMP_IRQ_NOTIFY_Bits.TBWC6 */
#define IFX_GTM_CMP_IRQ_NOTIFY_TBWC6_MSK (0x1u)

/** \brief Offset for Ifx_GTM_CMP_IRQ_NOTIFY_Bits.TBWC6 */
#define IFX_GTM_CMP_IRQ_NOTIFY_TBWC6_OFF (18u)

/** \brief Length for Ifx_GTM_CMP_IRQ_NOTIFY_Bits.TBWC7 */
#define IFX_GTM_CMP_IRQ_NOTIFY_TBWC7_LEN (1u)

/** \brief Mask for Ifx_GTM_CMP_IRQ_NOTIFY_Bits.TBWC7 */
#define IFX_GTM_CMP_IRQ_NOTIFY_TBWC7_MSK (0x1u)

/** \brief Offset for Ifx_GTM_CMP_IRQ_NOTIFY_Bits.TBWC7 */
#define IFX_GTM_CMP_IRQ_NOTIFY_TBWC7_OFF (19u)

/** \brief Length for Ifx_GTM_CMP_IRQ_NOTIFY_Bits.TBWC8 */
#define IFX_GTM_CMP_IRQ_NOTIFY_TBWC8_LEN (1u)

/** \brief Mask for Ifx_GTM_CMP_IRQ_NOTIFY_Bits.TBWC8 */
#define IFX_GTM_CMP_IRQ_NOTIFY_TBWC8_MSK (0x1u)

/** \brief Offset for Ifx_GTM_CMP_IRQ_NOTIFY_Bits.TBWC8 */
#define IFX_GTM_CMP_IRQ_NOTIFY_TBWC8_OFF (20u)

/** \brief Length for Ifx_GTM_CMP_IRQ_NOTIFY_Bits.TBWC9 */
#define IFX_GTM_CMP_IRQ_NOTIFY_TBWC9_LEN (1u)

/** \brief Mask for Ifx_GTM_CMP_IRQ_NOTIFY_Bits.TBWC9 */
#define IFX_GTM_CMP_IRQ_NOTIFY_TBWC9_MSK (0x1u)

/** \brief Offset for Ifx_GTM_CMP_IRQ_NOTIFY_Bits.TBWC9 */
#define IFX_GTM_CMP_IRQ_NOTIFY_TBWC9_OFF (21u)

/** \brief Length for Ifx_GTM_CMP_IRQ_NOTIFY_Bits.TBWC10 */
#define IFX_GTM_CMP_IRQ_NOTIFY_TBWC10_LEN (1u)

/** \brief Mask for Ifx_GTM_CMP_IRQ_NOTIFY_Bits.TBWC10 */
#define IFX_GTM_CMP_IRQ_NOTIFY_TBWC10_MSK (0x1u)

/** \brief Offset for Ifx_GTM_CMP_IRQ_NOTIFY_Bits.TBWC10 */
#define IFX_GTM_CMP_IRQ_NOTIFY_TBWC10_OFF (22u)

/** \brief Length for Ifx_GTM_CMP_IRQ_NOTIFY_Bits.TBWC11 */
#define IFX_GTM_CMP_IRQ_NOTIFY_TBWC11_LEN (1u)

/** \brief Mask for Ifx_GTM_CMP_IRQ_NOTIFY_Bits.TBWC11 */
#define IFX_GTM_CMP_IRQ_NOTIFY_TBWC11_MSK (0x1u)

/** \brief Offset for Ifx_GTM_CMP_IRQ_NOTIFY_Bits.TBWC11 */
#define IFX_GTM_CMP_IRQ_NOTIFY_TBWC11_OFF (23u)

/** \brief Length for Ifx_GTM_CMP_IRQ_EN_Bits.ABWC0_EN_IRQ */
#define IFX_GTM_CMP_IRQ_EN_ABWC0_EN_IRQ_LEN (1u)

/** \brief Mask for Ifx_GTM_CMP_IRQ_EN_Bits.ABWC0_EN_IRQ */
#define IFX_GTM_CMP_IRQ_EN_ABWC0_EN_IRQ_MSK (0x1u)

/** \brief Offset for Ifx_GTM_CMP_IRQ_EN_Bits.ABWC0_EN_IRQ */
#define IFX_GTM_CMP_IRQ_EN_ABWC0_EN_IRQ_OFF (0u)

/** \brief Length for Ifx_GTM_CMP_IRQ_EN_Bits.ABWC1_EN_IRQ */
#define IFX_GTM_CMP_IRQ_EN_ABWC1_EN_IRQ_LEN (1u)

/** \brief Mask for Ifx_GTM_CMP_IRQ_EN_Bits.ABWC1_EN_IRQ */
#define IFX_GTM_CMP_IRQ_EN_ABWC1_EN_IRQ_MSK (0x1u)

/** \brief Offset for Ifx_GTM_CMP_IRQ_EN_Bits.ABWC1_EN_IRQ */
#define IFX_GTM_CMP_IRQ_EN_ABWC1_EN_IRQ_OFF (1u)

/** \brief Length for Ifx_GTM_CMP_IRQ_EN_Bits.ABWC2_EN_IRQ */
#define IFX_GTM_CMP_IRQ_EN_ABWC2_EN_IRQ_LEN (1u)

/** \brief Mask for Ifx_GTM_CMP_IRQ_EN_Bits.ABWC2_EN_IRQ */
#define IFX_GTM_CMP_IRQ_EN_ABWC2_EN_IRQ_MSK (0x1u)

/** \brief Offset for Ifx_GTM_CMP_IRQ_EN_Bits.ABWC2_EN_IRQ */
#define IFX_GTM_CMP_IRQ_EN_ABWC2_EN_IRQ_OFF (2u)

/** \brief Length for Ifx_GTM_CMP_IRQ_EN_Bits.ABWC3_EN_IRQ */
#define IFX_GTM_CMP_IRQ_EN_ABWC3_EN_IRQ_LEN (1u)

/** \brief Mask for Ifx_GTM_CMP_IRQ_EN_Bits.ABWC3_EN_IRQ */
#define IFX_GTM_CMP_IRQ_EN_ABWC3_EN_IRQ_MSK (0x1u)

/** \brief Offset for Ifx_GTM_CMP_IRQ_EN_Bits.ABWC3_EN_IRQ */
#define IFX_GTM_CMP_IRQ_EN_ABWC3_EN_IRQ_OFF (3u)

/** \brief Length for Ifx_GTM_CMP_IRQ_EN_Bits.TBWC0_EN_IRQ */
#define IFX_GTM_CMP_IRQ_EN_TBWC0_EN_IRQ_LEN (1u)

/** \brief Mask for Ifx_GTM_CMP_IRQ_EN_Bits.TBWC0_EN_IRQ */
#define IFX_GTM_CMP_IRQ_EN_TBWC0_EN_IRQ_MSK (0x1u)

/** \brief Offset for Ifx_GTM_CMP_IRQ_EN_Bits.TBWC0_EN_IRQ */
#define IFX_GTM_CMP_IRQ_EN_TBWC0_EN_IRQ_OFF (12u)

/** \brief Length for Ifx_GTM_CMP_IRQ_EN_Bits.TBWC1_EN_IRQ */
#define IFX_GTM_CMP_IRQ_EN_TBWC1_EN_IRQ_LEN (1u)

/** \brief Mask for Ifx_GTM_CMP_IRQ_EN_Bits.TBWC1_EN_IRQ */
#define IFX_GTM_CMP_IRQ_EN_TBWC1_EN_IRQ_MSK (0x1u)

/** \brief Offset for Ifx_GTM_CMP_IRQ_EN_Bits.TBWC1_EN_IRQ */
#define IFX_GTM_CMP_IRQ_EN_TBWC1_EN_IRQ_OFF (13u)

/** \brief Length for Ifx_GTM_CMP_IRQ_EN_Bits.TBWC2_EN_IRQ */
#define IFX_GTM_CMP_IRQ_EN_TBWC2_EN_IRQ_LEN (1u)

/** \brief Mask for Ifx_GTM_CMP_IRQ_EN_Bits.TBWC2_EN_IRQ */
#define IFX_GTM_CMP_IRQ_EN_TBWC2_EN_IRQ_MSK (0x1u)

/** \brief Offset for Ifx_GTM_CMP_IRQ_EN_Bits.TBWC2_EN_IRQ */
#define IFX_GTM_CMP_IRQ_EN_TBWC2_EN_IRQ_OFF (14u)

/** \brief Length for Ifx_GTM_CMP_IRQ_EN_Bits.TBWC3_EN_IRQ */
#define IFX_GTM_CMP_IRQ_EN_TBWC3_EN_IRQ_LEN (1u)

/** \brief Mask for Ifx_GTM_CMP_IRQ_EN_Bits.TBWC3_EN_IRQ */
#define IFX_GTM_CMP_IRQ_EN_TBWC3_EN_IRQ_MSK (0x1u)

/** \brief Offset for Ifx_GTM_CMP_IRQ_EN_Bits.TBWC3_EN_IRQ */
#define IFX_GTM_CMP_IRQ_EN_TBWC3_EN_IRQ_OFF (15u)

/** \brief Length for Ifx_GTM_CMP_IRQ_EN_Bits.TBWC4_EN_IRQ */
#define IFX_GTM_CMP_IRQ_EN_TBWC4_EN_IRQ_LEN (1u)

/** \brief Mask for Ifx_GTM_CMP_IRQ_EN_Bits.TBWC4_EN_IRQ */
#define IFX_GTM_CMP_IRQ_EN_TBWC4_EN_IRQ_MSK (0x1u)

/** \brief Offset for Ifx_GTM_CMP_IRQ_EN_Bits.TBWC4_EN_IRQ */
#define IFX_GTM_CMP_IRQ_EN_TBWC4_EN_IRQ_OFF (16u)

/** \brief Length for Ifx_GTM_CMP_IRQ_EN_Bits.TBWC5_EN_IRQ */
#define IFX_GTM_CMP_IRQ_EN_TBWC5_EN_IRQ_LEN (1u)

/** \brief Mask for Ifx_GTM_CMP_IRQ_EN_Bits.TBWC5_EN_IRQ */
#define IFX_GTM_CMP_IRQ_EN_TBWC5_EN_IRQ_MSK (0x1u)

/** \brief Offset for Ifx_GTM_CMP_IRQ_EN_Bits.TBWC5_EN_IRQ */
#define IFX_GTM_CMP_IRQ_EN_TBWC5_EN_IRQ_OFF (17u)

