pjpfxq/Infineon_Mcal/Src/Infra_Prod/Sfr/TC32xA/_Reg/IfxGtm_bf.h
/** \brief Mask for Ifx_GTM_ICM_IRQG_CI_TOM_Bits.TOM_M1_CH1_IRQ */
#define IFX_GTM_ICM_IRQG_CI_TOM_TOM_M1_CH1_IRQ_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ICM_IRQG_CI_TOM_Bits.TOM_M1_CH1_IRQ */
#define IFX_GTM_ICM_IRQG_CI_TOM_TOM_M1_CH1_IRQ_OFF (17u)

/** \brief Length for Ifx_GTM_ICM_IRQG_CI_TOM_Bits.TOM_M1_CH2_IRQ */
#define IFX_GTM_ICM_IRQG_CI_TOM_TOM_M1_CH2_IRQ_LEN (1u)

/** \brief Mask for Ifx_GTM_ICM_IRQG_CI_TOM_Bits.TOM_M1_CH2_IRQ */
#define IFX_GTM_ICM_IRQG_CI_TOM_TOM_M1_CH2_IRQ_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ICM_IRQG_CI_TOM_Bits.TOM_M1_CH2_IRQ */
#define IFX_GTM_ICM_IRQG_CI_TOM_TOM_M1_CH2_IRQ_OFF (18u)

/** \brief Length for Ifx_GTM_ICM_IRQG_CI_TOM_Bits.TOM_M1_CH3_IRQ */
#define IFX_GTM_ICM_IRQG_CI_TOM_TOM_M1_CH3_IRQ_LEN (1u)

/** \brief Mask for Ifx_GTM_ICM_IRQG_CI_TOM_Bits.TOM_M1_CH3_IRQ */
#define IFX_GTM_ICM_IRQG_CI_TOM_TOM_M1_CH3_IRQ_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ICM_IRQG_CI_TOM_Bits.TOM_M1_CH3_IRQ */
#define IFX_GTM_ICM_IRQG_CI_TOM_TOM_M1_CH3_IRQ_OFF (19u)

/** \brief Length for Ifx_GTM_ICM_IRQG_CI_TOM_Bits.TOM_M1_CH4_IRQ */
#define IFX_GTM_ICM_IRQG_CI_TOM_TOM_M1_CH4_IRQ_LEN (1u)

/** \brief Mask for Ifx_GTM_ICM_IRQG_CI_TOM_Bits.TOM_M1_CH4_IRQ */
#define IFX_GTM_ICM_IRQG_CI_TOM_TOM_M1_CH4_IRQ_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ICM_IRQG_CI_TOM_Bits.TOM_M1_CH4_IRQ */
#define IFX_GTM_ICM_IRQG_CI_TOM_TOM_M1_CH4_IRQ_OFF (20u)

/** \brief Length for Ifx_GTM_ICM_IRQG_CI_TOM_Bits.TOM_M1_CH5_IRQ */
#define IFX_GTM_ICM_IRQG_CI_TOM_TOM_M1_CH5_IRQ_LEN (1u)

/** \brief Mask for Ifx_GTM_ICM_IRQG_CI_TOM_Bits.TOM_M1_CH5_IRQ */
#define IFX_GTM_ICM_IRQG_CI_TOM_TOM_M1_CH5_IRQ_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ICM_IRQG_CI_TOM_Bits.TOM_M1_CH5_IRQ */
#define IFX_GTM_ICM_IRQG_CI_TOM_TOM_M1_CH5_IRQ_OFF (21u)

/** \brief Length for Ifx_GTM_ICM_IRQG_CI_TOM_Bits.TOM_M1_CH6_IRQ */
#define IFX_GTM_ICM_IRQG_CI_TOM_TOM_M1_CH6_IRQ_LEN (1u)

/** \brief Mask for Ifx_GTM_ICM_IRQG_CI_TOM_Bits.TOM_M1_CH6_IRQ */
#define IFX_GTM_ICM_IRQG_CI_TOM_TOM_M1_CH6_IRQ_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ICM_IRQG_CI_TOM_Bits.TOM_M1_CH6_IRQ */
#define IFX_GTM_ICM_IRQG_CI_TOM_TOM_M1_CH6_IRQ_OFF (22u)

/** \brief Length for Ifx_GTM_ICM_IRQG_CI_TOM_Bits.TOM_M1_CH7_IRQ */
#define IFX_GTM_ICM_IRQG_CI_TOM_TOM_M1_CH7_IRQ_LEN (1u)

/** \brief Mask for Ifx_GTM_ICM_IRQG_CI_TOM_Bits.TOM_M1_CH7_IRQ */
#define IFX_GTM_ICM_IRQG_CI_TOM_TOM_M1_CH7_IRQ_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ICM_IRQG_CI_TOM_Bits.TOM_M1_CH7_IRQ */
#define IFX_GTM_ICM_IRQG_CI_TOM_TOM_M1_CH7_IRQ_OFF (23u)

/** \brief Length for Ifx_GTM_ICM_IRQG_CI_TOM_Bits.TOM_M1_CH8_IRQ */
#define IFX_GTM_ICM_IRQG_CI_TOM_TOM_M1_CH8_IRQ_LEN (1u)

/** \brief Mask for Ifx_GTM_ICM_IRQG_CI_TOM_Bits.TOM_M1_CH8_IRQ */
#define IFX_GTM_ICM_IRQG_CI_TOM_TOM_M1_CH8_IRQ_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ICM_IRQG_CI_TOM_Bits.TOM_M1_CH8_IRQ */
#define IFX_GTM_ICM_IRQG_CI_TOM_TOM_M1_CH8_IRQ_OFF (24u)

/** \brief Length for Ifx_GTM_ICM_IRQG_CI_TOM_Bits.TOM_M1_CH9_IRQ */
#define IFX_GTM_ICM_IRQG_CI_TOM_TOM_M1_CH9_IRQ_LEN (1u)

/** \brief Mask for Ifx_GTM_ICM_IRQG_CI_TOM_Bits.TOM_M1_CH9_IRQ */
#define IFX_GTM_ICM_IRQG_CI_TOM_TOM_M1_CH9_IRQ_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ICM_IRQG_CI_TOM_Bits.TOM_M1_CH9_IRQ */
#define IFX_GTM_ICM_IRQG_CI_TOM_TOM_M1_CH9_IRQ_OFF (25u)

/** \brief Length for Ifx_GTM_ICM_IRQG_CI_TOM_Bits.TOM_M1_CH10_IRQ */
#define IFX_GTM_ICM_IRQG_CI_TOM_TOM_M1_CH10_IRQ_LEN (1u)

/** \brief Mask for Ifx_GTM_ICM_IRQG_CI_TOM_Bits.TOM_M1_CH10_IRQ */
#define IFX_GTM_ICM_IRQG_CI_TOM_TOM_M1_CH10_IRQ_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ICM_IRQG_CI_TOM_Bits.TOM_M1_CH10_IRQ */
#define IFX_GTM_ICM_IRQG_CI_TOM_TOM_M1_CH10_IRQ_OFF (26u)

/** \brief Length for Ifx_GTM_ICM_IRQG_CI_TOM_Bits.TOM_M1_CH11_IRQ */
#define IFX_GTM_ICM_IRQG_CI_TOM_TOM_M1_CH11_IRQ_LEN (1u)

/** \brief Mask for Ifx_GTM_ICM_IRQG_CI_TOM_Bits.TOM_M1_CH11_IRQ */
#define IFX_GTM_ICM_IRQG_CI_TOM_TOM_M1_CH11_IRQ_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ICM_IRQG_CI_TOM_Bits.TOM_M1_CH11_IRQ */
#define IFX_GTM_ICM_IRQG_CI_TOM_TOM_M1_CH11_IRQ_OFF (27u)

/** \brief Length for Ifx_GTM_ICM_IRQG_CI_TOM_Bits.TOM_M1_CH12_IRQ */
#define IFX_GTM_ICM_IRQG_CI_TOM_TOM_M1_CH12_IRQ_LEN (1u)

/** \brief Mask for Ifx_GTM_ICM_IRQG_CI_TOM_Bits.TOM_M1_CH12_IRQ */
#define IFX_GTM_ICM_IRQG_CI_TOM_TOM_M1_CH12_IRQ_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ICM_IRQG_CI_TOM_Bits.TOM_M1_CH12_IRQ */
#define IFX_GTM_ICM_IRQG_CI_TOM_TOM_M1_CH12_IRQ_OFF (28u)

/** \brief Length for Ifx_GTM_ICM_IRQG_CI_TOM_Bits.TOM_M1_CH13_IRQ */
#define IFX_GTM_ICM_IRQG_CI_TOM_TOM_M1_CH13_IRQ_LEN (1u)

/** \brief Mask for Ifx_GTM_ICM_IRQG_CI_TOM_Bits.TOM_M1_CH13_IRQ */
#define IFX_GTM_ICM_IRQG_CI_TOM_TOM_M1_CH13_IRQ_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ICM_IRQG_CI_TOM_Bits.TOM_M1_CH13_IRQ */
#define IFX_GTM_ICM_IRQG_CI_TOM_TOM_M1_CH13_IRQ_OFF (29u)

/** \brief Length for Ifx_GTM_ICM_IRQG_CI_TOM_Bits.TOM_M1_CH14_IRQ */
#define IFX_GTM_ICM_IRQG_CI_TOM_TOM_M1_CH14_IRQ_LEN (1u)

/** \brief Mask for Ifx_GTM_ICM_IRQG_CI_TOM_Bits.TOM_M1_CH14_IRQ */
#define IFX_GTM_ICM_IRQG_CI_TOM_TOM_M1_CH14_IRQ_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ICM_IRQG_CI_TOM_Bits.TOM_M1_CH14_IRQ */
#define IFX_GTM_ICM_IRQG_CI_TOM_TOM_M1_CH14_IRQ_OFF (30u)

/** \brief Length for Ifx_GTM_ICM_IRQG_CI_TOM_Bits.TOM_M1_CH15_IRQ */
#define IFX_GTM_ICM_IRQG_CI_TOM_TOM_M1_CH15_IRQ_LEN (1u)

/** \brief Mask for Ifx_GTM_ICM_IRQG_CI_TOM_Bits.TOM_M1_CH15_IRQ */
#define IFX_GTM_ICM_IRQG_CI_TOM_TOM_M1_CH15_IRQ_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ICM_IRQG_CI_TOM_Bits.TOM_M1_CH15_IRQ */
#define IFX_GTM_ICM_IRQG_CI_TOM_TOM_M1_CH15_IRQ_OFF (31u)

/** \brief Length for Ifx_GTM_SPE_CTRL_STAT_Bits.EN */
#define IFX_GTM_SPE_CTRL_STAT_EN_LEN (1u)

/** \brief Mask for Ifx_GTM_SPE_CTRL_STAT_Bits.EN */
#define IFX_GTM_SPE_CTRL_STAT_EN_MSK (0x1u)

/** \brief Offset for Ifx_GTM_SPE_CTRL_STAT_Bits.EN */
#define IFX_GTM_SPE_CTRL_STAT_EN_OFF (0u)

/** \brief Length for Ifx_GTM_SPE_CTRL_STAT_Bits.SIE0 */
#define IFX_GTM_SPE_CTRL_STAT_SIE0_LEN (1u)

/** \brief Mask for Ifx_GTM_SPE_CTRL_STAT_Bits.SIE0 */
#define IFX_GTM_SPE_CTRL_STAT_SIE0_MSK (0x1u)

