pjpfxq/Infineon_Mcal/Src/Infra_Prod/Sfr/TC32xA/_Reg/IfxGtm_bf.h
/** \brief Mask for Ifx_GTM_TOM_TGC_FUPD_CTRL_Bits.RSTCN0_CH5 */
#define IFX_GTM_TOM_TGC_FUPD_CTRL_RSTCN0_CH5_MSK (0x3u)

/** \brief Offset for Ifx_GTM_TOM_TGC_FUPD_CTRL_Bits.RSTCN0_CH5 */
#define IFX_GTM_TOM_TGC_FUPD_CTRL_RSTCN0_CH5_OFF (26u)

/** \brief Length for Ifx_GTM_TOM_TGC_FUPD_CTRL_Bits.RSTCN0_CH6 */
#define IFX_GTM_TOM_TGC_FUPD_CTRL_RSTCN0_CH6_LEN (2u)

/** \brief Mask for Ifx_GTM_TOM_TGC_FUPD_CTRL_Bits.RSTCN0_CH6 */
#define IFX_GTM_TOM_TGC_FUPD_CTRL_RSTCN0_CH6_MSK (0x3u)

/** \brief Offset for Ifx_GTM_TOM_TGC_FUPD_CTRL_Bits.RSTCN0_CH6 */
#define IFX_GTM_TOM_TGC_FUPD_CTRL_RSTCN0_CH6_OFF (28u)

/** \brief Length for Ifx_GTM_TOM_TGC_FUPD_CTRL_Bits.RSTCN0_CH7 */
#define IFX_GTM_TOM_TGC_FUPD_CTRL_RSTCN0_CH7_LEN (2u)

/** \brief Mask for Ifx_GTM_TOM_TGC_FUPD_CTRL_Bits.RSTCN0_CH7 */
#define IFX_GTM_TOM_TGC_FUPD_CTRL_RSTCN0_CH7_MSK (0x3u)

/** \brief Offset for Ifx_GTM_TOM_TGC_FUPD_CTRL_Bits.RSTCN0_CH7 */
#define IFX_GTM_TOM_TGC_FUPD_CTRL_RSTCN0_CH7_OFF (30u)

/** \brief Length for Ifx_GTM_TOM_TGC_INT_TRIG_Bits.INT_TRIG0 */
#define IFX_GTM_TOM_TGC_INT_TRIG_INT_TRIG0_LEN (2u)

/** \brief Mask for Ifx_GTM_TOM_TGC_INT_TRIG_Bits.INT_TRIG0 */
#define IFX_GTM_TOM_TGC_INT_TRIG_INT_TRIG0_MSK (0x3u)

/** \brief Offset for Ifx_GTM_TOM_TGC_INT_TRIG_Bits.INT_TRIG0 */
#define IFX_GTM_TOM_TGC_INT_TRIG_INT_TRIG0_OFF (0u)

/** \brief Length for Ifx_GTM_TOM_TGC_INT_TRIG_Bits.INT_TRIG1 */
#define IFX_GTM_TOM_TGC_INT_TRIG_INT_TRIG1_LEN (2u)

/** \brief Mask for Ifx_GTM_TOM_TGC_INT_TRIG_Bits.INT_TRIG1 */
#define IFX_GTM_TOM_TGC_INT_TRIG_INT_TRIG1_MSK (0x3u)

/** \brief Offset for Ifx_GTM_TOM_TGC_INT_TRIG_Bits.INT_TRIG1 */
#define IFX_GTM_TOM_TGC_INT_TRIG_INT_TRIG1_OFF (2u)

/** \brief Length for Ifx_GTM_TOM_TGC_INT_TRIG_Bits.INT_TRIG2 */
#define IFX_GTM_TOM_TGC_INT_TRIG_INT_TRIG2_LEN (2u)

/** \brief Mask for Ifx_GTM_TOM_TGC_INT_TRIG_Bits.INT_TRIG2 */
#define IFX_GTM_TOM_TGC_INT_TRIG_INT_TRIG2_MSK (0x3u)

/** \brief Offset for Ifx_GTM_TOM_TGC_INT_TRIG_Bits.INT_TRIG2 */
#define IFX_GTM_TOM_TGC_INT_TRIG_INT_TRIG2_OFF (4u)

/** \brief Length for Ifx_GTM_TOM_TGC_INT_TRIG_Bits.INT_TRIG3 */
#define IFX_GTM_TOM_TGC_INT_TRIG_INT_TRIG3_LEN (2u)

/** \brief Mask for Ifx_GTM_TOM_TGC_INT_TRIG_Bits.INT_TRIG3 */
#define IFX_GTM_TOM_TGC_INT_TRIG_INT_TRIG3_MSK (0x3u)

/** \brief Offset for Ifx_GTM_TOM_TGC_INT_TRIG_Bits.INT_TRIG3 */
#define IFX_GTM_TOM_TGC_INT_TRIG_INT_TRIG3_OFF (6u)

/** \brief Length for Ifx_GTM_TOM_TGC_INT_TRIG_Bits.INT_TRIG4 */
#define IFX_GTM_TOM_TGC_INT_TRIG_INT_TRIG4_LEN (2u)

/** \brief Mask for Ifx_GTM_TOM_TGC_INT_TRIG_Bits.INT_TRIG4 */
#define IFX_GTM_TOM_TGC_INT_TRIG_INT_TRIG4_MSK (0x3u)

/** \brief Offset for Ifx_GTM_TOM_TGC_INT_TRIG_Bits.INT_TRIG4 */
#define IFX_GTM_TOM_TGC_INT_TRIG_INT_TRIG4_OFF (8u)

/** \brief Length for Ifx_GTM_TOM_TGC_INT_TRIG_Bits.INT_TRIG5 */
#define IFX_GTM_TOM_TGC_INT_TRIG_INT_TRIG5_LEN (2u)

/** \brief Mask for Ifx_GTM_TOM_TGC_INT_TRIG_Bits.INT_TRIG5 */
#define IFX_GTM_TOM_TGC_INT_TRIG_INT_TRIG5_MSK (0x3u)

/** \brief Offset for Ifx_GTM_TOM_TGC_INT_TRIG_Bits.INT_TRIG5 */
#define IFX_GTM_TOM_TGC_INT_TRIG_INT_TRIG5_OFF (10u)

/** \brief Length for Ifx_GTM_TOM_TGC_INT_TRIG_Bits.INT_TRIG6 */
#define IFX_GTM_TOM_TGC_INT_TRIG_INT_TRIG6_LEN (2u)

/** \brief Mask for Ifx_GTM_TOM_TGC_INT_TRIG_Bits.INT_TRIG6 */
#define IFX_GTM_TOM_TGC_INT_TRIG_INT_TRIG6_MSK (0x3u)

/** \brief Offset for Ifx_GTM_TOM_TGC_INT_TRIG_Bits.INT_TRIG6 */
#define IFX_GTM_TOM_TGC_INT_TRIG_INT_TRIG6_OFF (12u)

/** \brief Length for Ifx_GTM_TOM_TGC_INT_TRIG_Bits.INT_TRIG7 */
#define IFX_GTM_TOM_TGC_INT_TRIG_INT_TRIG7_LEN (2u)

/** \brief Mask for Ifx_GTM_TOM_TGC_INT_TRIG_Bits.INT_TRIG7 */
#define IFX_GTM_TOM_TGC_INT_TRIG_INT_TRIG7_MSK (0x3u)

/** \brief Offset for Ifx_GTM_TOM_TGC_INT_TRIG_Bits.INT_TRIG7 */
#define IFX_GTM_TOM_TGC_INT_TRIG_INT_TRIG7_OFF (14u)

/** \brief Length for Ifx_GTM_TOM_TGC_ENDIS_CTRL_Bits.ENDIS_CTRL0 */
#define IFX_GTM_TOM_TGC_ENDIS_CTRL_ENDIS_CTRL0_LEN (2u)

/** \brief Mask for Ifx_GTM_TOM_TGC_ENDIS_CTRL_Bits.ENDIS_CTRL0 */
#define IFX_GTM_TOM_TGC_ENDIS_CTRL_ENDIS_CTRL0_MSK (0x3u)

/** \brief Offset for Ifx_GTM_TOM_TGC_ENDIS_CTRL_Bits.ENDIS_CTRL0 */
#define IFX_GTM_TOM_TGC_ENDIS_CTRL_ENDIS_CTRL0_OFF (0u)

/** \brief Length for Ifx_GTM_TOM_TGC_ENDIS_CTRL_Bits.ENDIS_CTRL1 */
#define IFX_GTM_TOM_TGC_ENDIS_CTRL_ENDIS_CTRL1_LEN (2u)

/** \brief Mask for Ifx_GTM_TOM_TGC_ENDIS_CTRL_Bits.ENDIS_CTRL1 */
#define IFX_GTM_TOM_TGC_ENDIS_CTRL_ENDIS_CTRL1_MSK (0x3u)

/** \brief Offset for Ifx_GTM_TOM_TGC_ENDIS_CTRL_Bits.ENDIS_CTRL1 */
#define IFX_GTM_TOM_TGC_ENDIS_CTRL_ENDIS_CTRL1_OFF (2u)

/** \brief Length for Ifx_GTM_TOM_TGC_ENDIS_CTRL_Bits.ENDIS_CTRL2 */
#define IFX_GTM_TOM_TGC_ENDIS_CTRL_ENDIS_CTRL2_LEN (2u)

/** \brief Mask for Ifx_GTM_TOM_TGC_ENDIS_CTRL_Bits.ENDIS_CTRL2 */
#define IFX_GTM_TOM_TGC_ENDIS_CTRL_ENDIS_CTRL2_MSK (0x3u)

/** \brief Offset for Ifx_GTM_TOM_TGC_ENDIS_CTRL_Bits.ENDIS_CTRL2 */
#define IFX_GTM_TOM_TGC_ENDIS_CTRL_ENDIS_CTRL2_OFF (4u)

/** \brief Length for Ifx_GTM_TOM_TGC_ENDIS_CTRL_Bits.ENDIS_CTRL3 */
#define IFX_GTM_TOM_TGC_ENDIS_CTRL_ENDIS_CTRL3_LEN (2u)

/** \brief Mask for Ifx_GTM_TOM_TGC_ENDIS_CTRL_Bits.ENDIS_CTRL3 */
#define IFX_GTM_TOM_TGC_ENDIS_CTRL_ENDIS_CTRL3_MSK (0x3u)

/** \brief Offset for Ifx_GTM_TOM_TGC_ENDIS_CTRL_Bits.ENDIS_CTRL3 */
#define IFX_GTM_TOM_TGC_ENDIS_CTRL_ENDIS_CTRL3_OFF (6u)

/** \brief Length for Ifx_GTM_TOM_TGC_ENDIS_CTRL_Bits.ENDIS_CTRL4 */
#define IFX_GTM_TOM_TGC_ENDIS_CTRL_ENDIS_CTRL4_LEN (2u)

/** \brief Mask for Ifx_GTM_TOM_TGC_ENDIS_CTRL_Bits.ENDIS_CTRL4 */
#define IFX_GTM_TOM_TGC_ENDIS_CTRL_ENDIS_CTRL4_MSK (0x3u)

/** \brief Offset for Ifx_GTM_TOM_TGC_ENDIS_CTRL_Bits.ENDIS_CTRL4 */
#define IFX_GTM_TOM_TGC_ENDIS_CTRL_ENDIS_CTRL4_OFF (8u)

/** \brief Length for Ifx_GTM_TOM_TGC_ENDIS_CTRL_Bits.ENDIS_CTRL5 */
#define IFX_GTM_TOM_TGC_ENDIS_CTRL_ENDIS_CTRL5_LEN (2u)

/** \brief Mask for Ifx_GTM_TOM_TGC_ENDIS_CTRL_Bits.ENDIS_CTRL5 */
#define IFX_GTM_TOM_TGC_ENDIS_CTRL_ENDIS_CTRL5_MSK (0x3u)

/** \brief Offset for Ifx_GTM_TOM_TGC_ENDIS_CTRL_Bits.ENDIS_CTRL5 */
#define IFX_GTM_TOM_TGC_ENDIS_CTRL_ENDIS_CTRL5_OFF (10u)

/** \brief Length for Ifx_GTM_TOM_TGC_ENDIS_CTRL_Bits.ENDIS_CTRL6 */
#define IFX_GTM_TOM_TGC_ENDIS_CTRL_ENDIS_CTRL6_LEN (2u)

/** \brief Mask for Ifx_GTM_TOM_TGC_ENDIS_CTRL_Bits.ENDIS_CTRL6 */
#define IFX_GTM_TOM_TGC_ENDIS_CTRL_ENDIS_CTRL6_MSK (0x3u)

/** \brief Offset for Ifx_GTM_TOM_TGC_ENDIS_CTRL_Bits.ENDIS_CTRL6 */
#define IFX_GTM_TOM_TGC_ENDIS_CTRL_ENDIS_CTRL6_OFF (12u)

/** \brief Length for Ifx_GTM_TOM_TGC_ENDIS_CTRL_Bits.ENDIS_CTRL7 */
#define IFX_GTM_TOM_TGC_ENDIS_CTRL_ENDIS_CTRL7_LEN (2u)

