pjpfxq/Infineon_Mcal/Src/Infra_Prod/Sfr/TC32xA/_Reg/IfxGtm_bf.h
/** \brief Offset for Ifx_GTM_CCM_PROT_Bits.CLS_PROT */
#define IFX_GTM_CCM_PROT_CLS_PROT_OFF (0u)

/** \brief Length for Ifx_GTM_CDTM_DTM_CTRL_Bits.CLK_SEL */
#define IFX_GTM_CDTM_DTM_CTRL_CLK_SEL_LEN (2u)

/** \brief Mask for Ifx_GTM_CDTM_DTM_CTRL_Bits.CLK_SEL */
#define IFX_GTM_CDTM_DTM_CTRL_CLK_SEL_MSK (0x3u)

/** \brief Offset for Ifx_GTM_CDTM_DTM_CTRL_Bits.CLK_SEL */
#define IFX_GTM_CDTM_DTM_CTRL_CLK_SEL_OFF (0u)

/** \brief Length for Ifx_GTM_CDTM_DTM_CTRL_Bits.DTM_SEL */
#define IFX_GTM_CDTM_DTM_CTRL_DTM_SEL_LEN (2u)

/** \brief Mask for Ifx_GTM_CDTM_DTM_CTRL_Bits.DTM_SEL */
#define IFX_GTM_CDTM_DTM_CTRL_DTM_SEL_MSK (0x3u)

/** \brief Offset for Ifx_GTM_CDTM_DTM_CTRL_Bits.DTM_SEL */
#define IFX_GTM_CDTM_DTM_CTRL_DTM_SEL_OFF (2u)

/** \brief Length for Ifx_GTM_CDTM_DTM_CTRL_Bits.UPD_MODE */
#define IFX_GTM_CDTM_DTM_CTRL_UPD_MODE_LEN (3u)

/** \brief Mask for Ifx_GTM_CDTM_DTM_CTRL_Bits.UPD_MODE */
#define IFX_GTM_CDTM_DTM_CTRL_UPD_MODE_MSK (0x7u)

/** \brief Offset for Ifx_GTM_CDTM_DTM_CTRL_Bits.UPD_MODE */
#define IFX_GTM_CDTM_DTM_CTRL_UPD_MODE_OFF (4u)

/** \brief Length for Ifx_GTM_CDTM_DTM_CTRL_Bits.SR_UPD_EN */
#define IFX_GTM_CDTM_DTM_CTRL_SR_UPD_EN_LEN (1u)

/** \brief Mask for Ifx_GTM_CDTM_DTM_CTRL_Bits.SR_UPD_EN */
#define IFX_GTM_CDTM_DTM_CTRL_SR_UPD_EN_MSK (0x1u)

/** \brief Offset for Ifx_GTM_CDTM_DTM_CTRL_Bits.SR_UPD_EN */
#define IFX_GTM_CDTM_DTM_CTRL_SR_UPD_EN_OFF (8u)

/** \brief Length for Ifx_GTM_CDTM_DTM_CTRL_Bits.SHUT_OFF_RST */
#define IFX_GTM_CDTM_DTM_CTRL_SHUT_OFF_RST_LEN (1u)

/** \brief Mask for Ifx_GTM_CDTM_DTM_CTRL_Bits.SHUT_OFF_RST */
#define IFX_GTM_CDTM_DTM_CTRL_SHUT_OFF_RST_MSK (0x1u)

/** \brief Offset for Ifx_GTM_CDTM_DTM_CTRL_Bits.SHUT_OFF_RST */
#define IFX_GTM_CDTM_DTM_CTRL_SHUT_OFF_RST_OFF (16u)

/** \brief Length for Ifx_GTM_CDTM_DTM_CH_CTRL1_Bits.O1SEL_0 */
#define IFX_GTM_CDTM_DTM_CH_CTRL1_O1SEL_0_LEN (1u)

/** \brief Mask for Ifx_GTM_CDTM_DTM_CH_CTRL1_Bits.O1SEL_0 */
#define IFX_GTM_CDTM_DTM_CH_CTRL1_O1SEL_0_MSK (0x1u)

/** \brief Offset for Ifx_GTM_CDTM_DTM_CH_CTRL1_Bits.O1SEL_0 */
#define IFX_GTM_CDTM_DTM_CH_CTRL1_O1SEL_0_OFF (0u)

/** \brief Length for Ifx_GTM_CDTM_DTM_CH_CTRL1_Bits.I1SEL_0 */
#define IFX_GTM_CDTM_DTM_CH_CTRL1_I1SEL_0_LEN (1u)

/** \brief Mask for Ifx_GTM_CDTM_DTM_CH_CTRL1_Bits.I1SEL_0 */
#define IFX_GTM_CDTM_DTM_CH_CTRL1_I1SEL_0_MSK (0x1u)

/** \brief Offset for Ifx_GTM_CDTM_DTM_CH_CTRL1_Bits.I1SEL_0 */
#define IFX_GTM_CDTM_DTM_CH_CTRL1_I1SEL_0_OFF (1u)

/** \brief Length for Ifx_GTM_CDTM_DTM_CH_CTRL1_Bits.SWAP_0 */
#define IFX_GTM_CDTM_DTM_CH_CTRL1_SWAP_0_LEN (1u)

/** \brief Mask for Ifx_GTM_CDTM_DTM_CH_CTRL1_Bits.SWAP_0 */
#define IFX_GTM_CDTM_DTM_CH_CTRL1_SWAP_0_MSK (0x1u)

/** \brief Offset for Ifx_GTM_CDTM_DTM_CH_CTRL1_Bits.SWAP_0 */
#define IFX_GTM_CDTM_DTM_CH_CTRL1_SWAP_0_OFF (3u)

/** \brief Length for Ifx_GTM_CDTM_DTM_CH_CTRL1_Bits.O1F_0 */
#define IFX_GTM_CDTM_DTM_CH_CTRL1_O1F_0_LEN (2u)

/** \brief Mask for Ifx_GTM_CDTM_DTM_CH_CTRL1_Bits.O1F_0 */
#define IFX_GTM_CDTM_DTM_CH_CTRL1_O1F_0_MSK (0x3u)

/** \brief Offset for Ifx_GTM_CDTM_DTM_CH_CTRL1_Bits.O1F_0 */
#define IFX_GTM_CDTM_DTM_CH_CTRL1_O1F_0_OFF (4u)

/** \brief Length for Ifx_GTM_CDTM_DTM_CH_CTRL1_Bits.XDT_EN_0_1 */
#define IFX_GTM_CDTM_DTM_CH_CTRL1_XDT_EN_0_1_LEN (1u)

/** \brief Mask for Ifx_GTM_CDTM_DTM_CH_CTRL1_Bits.XDT_EN_0_1 */
#define IFX_GTM_CDTM_DTM_CH_CTRL1_XDT_EN_0_1_MSK (0x1u)

/** \brief Offset for Ifx_GTM_CDTM_DTM_CH_CTRL1_Bits.XDT_EN_0_1 */
#define IFX_GTM_CDTM_DTM_CH_CTRL1_XDT_EN_0_1_OFF (6u)

/** \brief Length for Ifx_GTM_CDTM_DTM_CH_CTRL1_Bits.O1SEL_1 */
#define IFX_GTM_CDTM_DTM_CH_CTRL1_O1SEL_1_LEN (1u)

/** \brief Mask for Ifx_GTM_CDTM_DTM_CH_CTRL1_Bits.O1SEL_1 */
#define IFX_GTM_CDTM_DTM_CH_CTRL1_O1SEL_1_MSK (0x1u)

/** \brief Offset for Ifx_GTM_CDTM_DTM_CH_CTRL1_Bits.O1SEL_1 */
#define IFX_GTM_CDTM_DTM_CH_CTRL1_O1SEL_1_OFF (8u)

/** \brief Length for Ifx_GTM_CDTM_DTM_CH_CTRL1_Bits.I1SEL_1 */
#define IFX_GTM_CDTM_DTM_CH_CTRL1_I1SEL_1_LEN (1u)

/** \brief Mask for Ifx_GTM_CDTM_DTM_CH_CTRL1_Bits.I1SEL_1 */
#define IFX_GTM_CDTM_DTM_CH_CTRL1_I1SEL_1_MSK (0x1u)

/** \brief Offset for Ifx_GTM_CDTM_DTM_CH_CTRL1_Bits.I1SEL_1 */
#define IFX_GTM_CDTM_DTM_CH_CTRL1_I1SEL_1_OFF (9u)

/** \brief Length for Ifx_GTM_CDTM_DTM_CH_CTRL1_Bits.SH_EN_1 */
#define IFX_GTM_CDTM_DTM_CH_CTRL1_SH_EN_1_LEN (1u)

/** \brief Mask for Ifx_GTM_CDTM_DTM_CH_CTRL1_Bits.SH_EN_1 */
#define IFX_GTM_CDTM_DTM_CH_CTRL1_SH_EN_1_MSK (0x1u)

/** \brief Offset for Ifx_GTM_CDTM_DTM_CH_CTRL1_Bits.SH_EN_1 */
#define IFX_GTM_CDTM_DTM_CH_CTRL1_SH_EN_1_OFF (10u)

/** \brief Length for Ifx_GTM_CDTM_DTM_CH_CTRL1_Bits.SWAP_1 */
#define IFX_GTM_CDTM_DTM_CH_CTRL1_SWAP_1_LEN (1u)

/** \brief Mask for Ifx_GTM_CDTM_DTM_CH_CTRL1_Bits.SWAP_1 */
#define IFX_GTM_CDTM_DTM_CH_CTRL1_SWAP_1_MSK (0x1u)

/** \brief Offset for Ifx_GTM_CDTM_DTM_CH_CTRL1_Bits.SWAP_1 */
#define IFX_GTM_CDTM_DTM_CH_CTRL1_SWAP_1_OFF (11u)

/** \brief Length for Ifx_GTM_CDTM_DTM_CH_CTRL1_Bits.O1F_1 */
#define IFX_GTM_CDTM_DTM_CH_CTRL1_O1F_1_LEN (2u)

/** \brief Mask for Ifx_GTM_CDTM_DTM_CH_CTRL1_Bits.O1F_1 */
#define IFX_GTM_CDTM_DTM_CH_CTRL1_O1F_1_MSK (0x3u)

/** \brief Offset for Ifx_GTM_CDTM_DTM_CH_CTRL1_Bits.O1F_1 */
#define IFX_GTM_CDTM_DTM_CH_CTRL1_O1F_1_OFF (12u)

/** \brief Length for Ifx_GTM_CDTM_DTM_CH_CTRL1_Bits.O1SEL_2 */
#define IFX_GTM_CDTM_DTM_CH_CTRL1_O1SEL_2_LEN (1u)

/** \brief Mask for Ifx_GTM_CDTM_DTM_CH_CTRL1_Bits.O1SEL_2 */
#define IFX_GTM_CDTM_DTM_CH_CTRL1_O1SEL_2_MSK (0x1u)

/** \brief Offset for Ifx_GTM_CDTM_DTM_CH_CTRL1_Bits.O1SEL_2 */
#define IFX_GTM_CDTM_DTM_CH_CTRL1_O1SEL_2_OFF (16u)

/** \brief Length for Ifx_GTM_CDTM_DTM_CH_CTRL1_Bits.I1SEL_2 */
#define IFX_GTM_CDTM_DTM_CH_CTRL1_I1SEL_2_LEN (1u)

/** \brief Mask for Ifx_GTM_CDTM_DTM_CH_CTRL1_Bits.I1SEL_2 */
#define IFX_GTM_CDTM_DTM_CH_CTRL1_I1SEL_2_MSK (0x1u)

/** \brief Offset for Ifx_GTM_CDTM_DTM_CH_CTRL1_Bits.I1SEL_2 */
#define IFX_GTM_CDTM_DTM_CH_CTRL1_I1SEL_2_OFF (17u)

/** \brief Length for Ifx_GTM_CDTM_DTM_CH_CTRL1_Bits.SH_EN_2 */
#define IFX_GTM_CDTM_DTM_CH_CTRL1_SH_EN_2_LEN (1u)

/** \brief Mask for Ifx_GTM_CDTM_DTM_CH_CTRL1_Bits.SH_EN_2 */
#define IFX_GTM_CDTM_DTM_CH_CTRL1_SH_EN_2_MSK (0x1u)

/** \brief Offset for Ifx_GTM_CDTM_DTM_CH_CTRL1_Bits.SH_EN_2 */
#define IFX_GTM_CDTM_DTM_CH_CTRL1_SH_EN_2_OFF (18u)

/** \brief Length for Ifx_GTM_CDTM_DTM_CH_CTRL1_Bits.SWAP_2 */
#define IFX_GTM_CDTM_DTM_CH_CTRL1_SWAP_2_LEN (1u)

/** \brief Mask for Ifx_GTM_CDTM_DTM_CH_CTRL1_Bits.SWAP_2 */
#define IFX_GTM_CDTM_DTM_CH_CTRL1_SWAP_2_MSK (0x1u)

