pjpfxq/Infineon_Mcal/Src/Infra_Prod/Sfr/TC32xA/_Reg/IfxGtm_bf.h
/** \brief Offset for Ifx_GTM_CDTM_DTM_CH_CTRL2_Bits.DT0_1 */
#define IFX_GTM_CDTM_DTM_CH_CTRL2_DT0_1_OFF (11u)

/** \brief Length for Ifx_GTM_CDTM_DTM_CH_CTRL2_Bits.POL1_1 */
#define IFX_GTM_CDTM_DTM_CH_CTRL2_POL1_1_LEN (1u)

/** \brief Mask for Ifx_GTM_CDTM_DTM_CH_CTRL2_Bits.POL1_1 */
#define IFX_GTM_CDTM_DTM_CH_CTRL2_POL1_1_MSK (0x1u)

/** \brief Offset for Ifx_GTM_CDTM_DTM_CH_CTRL2_Bits.POL1_1 */
#define IFX_GTM_CDTM_DTM_CH_CTRL2_POL1_1_OFF (12u)

/** \brief Length for Ifx_GTM_CDTM_DTM_CH_CTRL2_Bits.OC1_1 */
#define IFX_GTM_CDTM_DTM_CH_CTRL2_OC1_1_LEN (1u)

/** \brief Mask for Ifx_GTM_CDTM_DTM_CH_CTRL2_Bits.OC1_1 */
#define IFX_GTM_CDTM_DTM_CH_CTRL2_OC1_1_MSK (0x1u)

/** \brief Offset for Ifx_GTM_CDTM_DTM_CH_CTRL2_Bits.OC1_1 */
#define IFX_GTM_CDTM_DTM_CH_CTRL2_OC1_1_OFF (13u)

/** \brief Length for Ifx_GTM_CDTM_DTM_CH_CTRL2_Bits.SL1_1 */
#define IFX_GTM_CDTM_DTM_CH_CTRL2_SL1_1_LEN (1u)

/** \brief Mask for Ifx_GTM_CDTM_DTM_CH_CTRL2_Bits.SL1_1 */
#define IFX_GTM_CDTM_DTM_CH_CTRL2_SL1_1_MSK (0x1u)

/** \brief Offset for Ifx_GTM_CDTM_DTM_CH_CTRL2_Bits.SL1_1 */
#define IFX_GTM_CDTM_DTM_CH_CTRL2_SL1_1_OFF (14u)

/** \brief Length for Ifx_GTM_CDTM_DTM_CH_CTRL2_Bits.DT1_1 */
#define IFX_GTM_CDTM_DTM_CH_CTRL2_DT1_1_LEN (1u)

/** \brief Mask for Ifx_GTM_CDTM_DTM_CH_CTRL2_Bits.DT1_1 */
#define IFX_GTM_CDTM_DTM_CH_CTRL2_DT1_1_MSK (0x1u)

/** \brief Offset for Ifx_GTM_CDTM_DTM_CH_CTRL2_Bits.DT1_1 */
#define IFX_GTM_CDTM_DTM_CH_CTRL2_DT1_1_OFF (15u)

/** \brief Length for Ifx_GTM_CDTM_DTM_CH_CTRL2_Bits.POL0_2 */
#define IFX_GTM_CDTM_DTM_CH_CTRL2_POL0_2_LEN (1u)

/** \brief Mask for Ifx_GTM_CDTM_DTM_CH_CTRL2_Bits.POL0_2 */
#define IFX_GTM_CDTM_DTM_CH_CTRL2_POL0_2_MSK (0x1u)

/** \brief Offset for Ifx_GTM_CDTM_DTM_CH_CTRL2_Bits.POL0_2 */
#define IFX_GTM_CDTM_DTM_CH_CTRL2_POL0_2_OFF (16u)

/** \brief Length for Ifx_GTM_CDTM_DTM_CH_CTRL2_Bits.OC0_2 */
#define IFX_GTM_CDTM_DTM_CH_CTRL2_OC0_2_LEN (1u)

/** \brief Mask for Ifx_GTM_CDTM_DTM_CH_CTRL2_Bits.OC0_2 */
#define IFX_GTM_CDTM_DTM_CH_CTRL2_OC0_2_MSK (0x1u)

/** \brief Offset for Ifx_GTM_CDTM_DTM_CH_CTRL2_Bits.OC0_2 */
#define IFX_GTM_CDTM_DTM_CH_CTRL2_OC0_2_OFF (17u)

/** \brief Length for Ifx_GTM_CDTM_DTM_CH_CTRL2_Bits.SL0_2 */
#define IFX_GTM_CDTM_DTM_CH_CTRL2_SL0_2_LEN (1u)

/** \brief Mask for Ifx_GTM_CDTM_DTM_CH_CTRL2_Bits.SL0_2 */
#define IFX_GTM_CDTM_DTM_CH_CTRL2_SL0_2_MSK (0x1u)

/** \brief Offset for Ifx_GTM_CDTM_DTM_CH_CTRL2_Bits.SL0_2 */
#define IFX_GTM_CDTM_DTM_CH_CTRL2_SL0_2_OFF (18u)

/** \brief Length for Ifx_GTM_CDTM_DTM_CH_CTRL2_Bits.DT0_2 */
#define IFX_GTM_CDTM_DTM_CH_CTRL2_DT0_2_LEN (1u)

/** \brief Mask for Ifx_GTM_CDTM_DTM_CH_CTRL2_Bits.DT0_2 */
#define IFX_GTM_CDTM_DTM_CH_CTRL2_DT0_2_MSK (0x1u)

/** \brief Offset for Ifx_GTM_CDTM_DTM_CH_CTRL2_Bits.DT0_2 */
#define IFX_GTM_CDTM_DTM_CH_CTRL2_DT0_2_OFF (19u)

/** \brief Length for Ifx_GTM_CDTM_DTM_CH_CTRL2_Bits.POL1_2 */
#define IFX_GTM_CDTM_DTM_CH_CTRL2_POL1_2_LEN (1u)

/** \brief Mask for Ifx_GTM_CDTM_DTM_CH_CTRL2_Bits.POL1_2 */
#define IFX_GTM_CDTM_DTM_CH_CTRL2_POL1_2_MSK (0x1u)

/** \brief Offset for Ifx_GTM_CDTM_DTM_CH_CTRL2_Bits.POL1_2 */
#define IFX_GTM_CDTM_DTM_CH_CTRL2_POL1_2_OFF (20u)

/** \brief Length for Ifx_GTM_CDTM_DTM_CH_CTRL2_Bits.OC1_2 */
#define IFX_GTM_CDTM_DTM_CH_CTRL2_OC1_2_LEN (1u)

/** \brief Mask for Ifx_GTM_CDTM_DTM_CH_CTRL2_Bits.OC1_2 */
#define IFX_GTM_CDTM_DTM_CH_CTRL2_OC1_2_MSK (0x1u)

/** \brief Offset for Ifx_GTM_CDTM_DTM_CH_CTRL2_Bits.OC1_2 */
#define IFX_GTM_CDTM_DTM_CH_CTRL2_OC1_2_OFF (21u)

/** \brief Length for Ifx_GTM_CDTM_DTM_CH_CTRL2_Bits.SL1_2 */
#define IFX_GTM_CDTM_DTM_CH_CTRL2_SL1_2_LEN (1u)

/** \brief Mask for Ifx_GTM_CDTM_DTM_CH_CTRL2_Bits.SL1_2 */
#define IFX_GTM_CDTM_DTM_CH_CTRL2_SL1_2_MSK (0x1u)

/** \brief Offset for Ifx_GTM_CDTM_DTM_CH_CTRL2_Bits.SL1_2 */
#define IFX_GTM_CDTM_DTM_CH_CTRL2_SL1_2_OFF (22u)

/** \brief Length for Ifx_GTM_CDTM_DTM_CH_CTRL2_Bits.DT1_2 */
#define IFX_GTM_CDTM_DTM_CH_CTRL2_DT1_2_LEN (1u)

/** \brief Mask for Ifx_GTM_CDTM_DTM_CH_CTRL2_Bits.DT1_2 */
#define IFX_GTM_CDTM_DTM_CH_CTRL2_DT1_2_MSK (0x1u)

/** \brief Offset for Ifx_GTM_CDTM_DTM_CH_CTRL2_Bits.DT1_2 */
#define IFX_GTM_CDTM_DTM_CH_CTRL2_DT1_2_OFF (23u)

/** \brief Length for Ifx_GTM_CDTM_DTM_CH_CTRL2_Bits.POL0_3 */
#define IFX_GTM_CDTM_DTM_CH_CTRL2_POL0_3_LEN (1u)

/** \brief Mask for Ifx_GTM_CDTM_DTM_CH_CTRL2_Bits.POL0_3 */
#define IFX_GTM_CDTM_DTM_CH_CTRL2_POL0_3_MSK (0x1u)

/** \brief Offset for Ifx_GTM_CDTM_DTM_CH_CTRL2_Bits.POL0_3 */
#define IFX_GTM_CDTM_DTM_CH_CTRL2_POL0_3_OFF (24u)

/** \brief Length for Ifx_GTM_CDTM_DTM_CH_CTRL2_Bits.OC0_3 */
#define IFX_GTM_CDTM_DTM_CH_CTRL2_OC0_3_LEN (1u)

/** \brief Mask for Ifx_GTM_CDTM_DTM_CH_CTRL2_Bits.OC0_3 */
#define IFX_GTM_CDTM_DTM_CH_CTRL2_OC0_3_MSK (0x1u)

/** \brief Offset for Ifx_GTM_CDTM_DTM_CH_CTRL2_Bits.OC0_3 */
#define IFX_GTM_CDTM_DTM_CH_CTRL2_OC0_3_OFF (25u)

/** \brief Length for Ifx_GTM_CDTM_DTM_CH_CTRL2_Bits.SL0_3 */
#define IFX_GTM_CDTM_DTM_CH_CTRL2_SL0_3_LEN (1u)

/** \brief Mask for Ifx_GTM_CDTM_DTM_CH_CTRL2_Bits.SL0_3 */
#define IFX_GTM_CDTM_DTM_CH_CTRL2_SL0_3_MSK (0x1u)

/** \brief Offset for Ifx_GTM_CDTM_DTM_CH_CTRL2_Bits.SL0_3 */
#define IFX_GTM_CDTM_DTM_CH_CTRL2_SL0_3_OFF (26u)

/** \brief Length for Ifx_GTM_CDTM_DTM_CH_CTRL2_Bits.DT0_3 */
#define IFX_GTM_CDTM_DTM_CH_CTRL2_DT0_3_LEN (1u)

/** \brief Mask for Ifx_GTM_CDTM_DTM_CH_CTRL2_Bits.DT0_3 */
#define IFX_GTM_CDTM_DTM_CH_CTRL2_DT0_3_MSK (0x1u)

/** \brief Offset for Ifx_GTM_CDTM_DTM_CH_CTRL2_Bits.DT0_3 */
#define IFX_GTM_CDTM_DTM_CH_CTRL2_DT0_3_OFF (27u)

/** \brief Length for Ifx_GTM_CDTM_DTM_CH_CTRL2_Bits.POL1_3 */
#define IFX_GTM_CDTM_DTM_CH_CTRL2_POL1_3_LEN (1u)

/** \brief Mask for Ifx_GTM_CDTM_DTM_CH_CTRL2_Bits.POL1_3 */
#define IFX_GTM_CDTM_DTM_CH_CTRL2_POL1_3_MSK (0x1u)

/** \brief Offset for Ifx_GTM_CDTM_DTM_CH_CTRL2_Bits.POL1_3 */
#define IFX_GTM_CDTM_DTM_CH_CTRL2_POL1_3_OFF (28u)

/** \brief Length for Ifx_GTM_CDTM_DTM_CH_CTRL2_Bits.OC1_3 */
#define IFX_GTM_CDTM_DTM_CH_CTRL2_OC1_3_LEN (1u)

/** \brief Mask for Ifx_GTM_CDTM_DTM_CH_CTRL2_Bits.OC1_3 */
#define IFX_GTM_CDTM_DTM_CH_CTRL2_OC1_3_MSK (0x1u)

