pjpfxq/Infineon_Mcal/Src/Infra_Prod/Sfr/TC32xA/_Reg/IfxGtm_bf.h
/** \brief Length for Ifx_GTM_CDTM_DTM_CH_CTRL2_SR_Bits.SL1_1_SR */
#define IFX_GTM_CDTM_DTM_CH_CTRL2_SR_SL1_1_SR_LEN (1u)

/** \brief Mask for Ifx_GTM_CDTM_DTM_CH_CTRL2_SR_Bits.SL1_1_SR */
#define IFX_GTM_CDTM_DTM_CH_CTRL2_SR_SL1_1_SR_MSK (0x1u)

/** \brief Offset for Ifx_GTM_CDTM_DTM_CH_CTRL2_SR_Bits.SL1_1_SR */
#define IFX_GTM_CDTM_DTM_CH_CTRL2_SR_SL1_1_SR_OFF (14u)

/** \brief Length for Ifx_GTM_CDTM_DTM_CH_CTRL2_SR_Bits.DT1_1_SR */
#define IFX_GTM_CDTM_DTM_CH_CTRL2_SR_DT1_1_SR_LEN (1u)

/** \brief Mask for Ifx_GTM_CDTM_DTM_CH_CTRL2_SR_Bits.DT1_1_SR */
#define IFX_GTM_CDTM_DTM_CH_CTRL2_SR_DT1_1_SR_MSK (0x1u)

/** \brief Offset for Ifx_GTM_CDTM_DTM_CH_CTRL2_SR_Bits.DT1_1_SR */
#define IFX_GTM_CDTM_DTM_CH_CTRL2_SR_DT1_1_SR_OFF (15u)

/** \brief Length for Ifx_GTM_CDTM_DTM_CH_CTRL2_SR_Bits.POL0_2_SR */
#define IFX_GTM_CDTM_DTM_CH_CTRL2_SR_POL0_2_SR_LEN (1u)

/** \brief Mask for Ifx_GTM_CDTM_DTM_CH_CTRL2_SR_Bits.POL0_2_SR */
#define IFX_GTM_CDTM_DTM_CH_CTRL2_SR_POL0_2_SR_MSK (0x1u)

/** \brief Offset for Ifx_GTM_CDTM_DTM_CH_CTRL2_SR_Bits.POL0_2_SR */
#define IFX_GTM_CDTM_DTM_CH_CTRL2_SR_POL0_2_SR_OFF (16u)

/** \brief Length for Ifx_GTM_CDTM_DTM_CH_CTRL2_SR_Bits.OC0_2_SR */
#define IFX_GTM_CDTM_DTM_CH_CTRL2_SR_OC0_2_SR_LEN (1u)

/** \brief Mask for Ifx_GTM_CDTM_DTM_CH_CTRL2_SR_Bits.OC0_2_SR */
#define IFX_GTM_CDTM_DTM_CH_CTRL2_SR_OC0_2_SR_MSK (0x1u)

/** \brief Offset for Ifx_GTM_CDTM_DTM_CH_CTRL2_SR_Bits.OC0_2_SR */
#define IFX_GTM_CDTM_DTM_CH_CTRL2_SR_OC0_2_SR_OFF (17u)

/** \brief Length for Ifx_GTM_CDTM_DTM_CH_CTRL2_SR_Bits.SL0_2_SR */
#define IFX_GTM_CDTM_DTM_CH_CTRL2_SR_SL0_2_SR_LEN (1u)

/** \brief Mask for Ifx_GTM_CDTM_DTM_CH_CTRL2_SR_Bits.SL0_2_SR */
#define IFX_GTM_CDTM_DTM_CH_CTRL2_SR_SL0_2_SR_MSK (0x1u)

/** \brief Offset for Ifx_GTM_CDTM_DTM_CH_CTRL2_SR_Bits.SL0_2_SR */
#define IFX_GTM_CDTM_DTM_CH_CTRL2_SR_SL0_2_SR_OFF (18u)

/** \brief Length for Ifx_GTM_CDTM_DTM_CH_CTRL2_SR_Bits.DT0_2_SR */
#define IFX_GTM_CDTM_DTM_CH_CTRL2_SR_DT0_2_SR_LEN (1u)

/** \brief Mask for Ifx_GTM_CDTM_DTM_CH_CTRL2_SR_Bits.DT0_2_SR */
#define IFX_GTM_CDTM_DTM_CH_CTRL2_SR_DT0_2_SR_MSK (0x1u)

/** \brief Offset for Ifx_GTM_CDTM_DTM_CH_CTRL2_SR_Bits.DT0_2_SR */
#define IFX_GTM_CDTM_DTM_CH_CTRL2_SR_DT0_2_SR_OFF (19u)

/** \brief Length for Ifx_GTM_CDTM_DTM_CH_CTRL2_SR_Bits.POL1_2_SR */
#define IFX_GTM_CDTM_DTM_CH_CTRL2_SR_POL1_2_SR_LEN (1u)

/** \brief Mask for Ifx_GTM_CDTM_DTM_CH_CTRL2_SR_Bits.POL1_2_SR */
#define IFX_GTM_CDTM_DTM_CH_CTRL2_SR_POL1_2_SR_MSK (0x1u)

/** \brief Offset for Ifx_GTM_CDTM_DTM_CH_CTRL2_SR_Bits.POL1_2_SR */
#define IFX_GTM_CDTM_DTM_CH_CTRL2_SR_POL1_2_SR_OFF (20u)

/** \brief Length for Ifx_GTM_CDTM_DTM_CH_CTRL2_SR_Bits.OC1_2_SR */
#define IFX_GTM_CDTM_DTM_CH_CTRL2_SR_OC1_2_SR_LEN (1u)

/** \brief Mask for Ifx_GTM_CDTM_DTM_CH_CTRL2_SR_Bits.OC1_2_SR */
#define IFX_GTM_CDTM_DTM_CH_CTRL2_SR_OC1_2_SR_MSK (0x1u)

/** \brief Offset for Ifx_GTM_CDTM_DTM_CH_CTRL2_SR_Bits.OC1_2_SR */
#define IFX_GTM_CDTM_DTM_CH_CTRL2_SR_OC1_2_SR_OFF (21u)

/** \brief Length for Ifx_GTM_CDTM_DTM_CH_CTRL2_SR_Bits.SL1_2_SR */
#define IFX_GTM_CDTM_DTM_CH_CTRL2_SR_SL1_2_SR_LEN (1u)

/** \brief Mask for Ifx_GTM_CDTM_DTM_CH_CTRL2_SR_Bits.SL1_2_SR */
#define IFX_GTM_CDTM_DTM_CH_CTRL2_SR_SL1_2_SR_MSK (0x1u)

/** \brief Offset for Ifx_GTM_CDTM_DTM_CH_CTRL2_SR_Bits.SL1_2_SR */
#define IFX_GTM_CDTM_DTM_CH_CTRL2_SR_SL1_2_SR_OFF (22u)

/** \brief Length for Ifx_GTM_CDTM_DTM_CH_CTRL2_SR_Bits.DT1_2_SR */
#define IFX_GTM_CDTM_DTM_CH_CTRL2_SR_DT1_2_SR_LEN (1u)

/** \brief Mask for Ifx_GTM_CDTM_DTM_CH_CTRL2_SR_Bits.DT1_2_SR */
#define IFX_GTM_CDTM_DTM_CH_CTRL2_SR_DT1_2_SR_MSK (0x1u)

/** \brief Offset for Ifx_GTM_CDTM_DTM_CH_CTRL2_SR_Bits.DT1_2_SR */
#define IFX_GTM_CDTM_DTM_CH_CTRL2_SR_DT1_2_SR_OFF (23u)

/** \brief Length for Ifx_GTM_CDTM_DTM_CH_CTRL2_SR_Bits.POL0_3_SR */
#define IFX_GTM_CDTM_DTM_CH_CTRL2_SR_POL0_3_SR_LEN (1u)

/** \brief Mask for Ifx_GTM_CDTM_DTM_CH_CTRL2_SR_Bits.POL0_3_SR */
#define IFX_GTM_CDTM_DTM_CH_CTRL2_SR_POL0_3_SR_MSK (0x1u)

/** \brief Offset for Ifx_GTM_CDTM_DTM_CH_CTRL2_SR_Bits.POL0_3_SR */
#define IFX_GTM_CDTM_DTM_CH_CTRL2_SR_POL0_3_SR_OFF (24u)

/** \brief Length for Ifx_GTM_CDTM_DTM_CH_CTRL2_SR_Bits.OC0_3_SR */
#define IFX_GTM_CDTM_DTM_CH_CTRL2_SR_OC0_3_SR_LEN (1u)

/** \brief Mask for Ifx_GTM_CDTM_DTM_CH_CTRL2_SR_Bits.OC0_3_SR */
#define IFX_GTM_CDTM_DTM_CH_CTRL2_SR_OC0_3_SR_MSK (0x1u)

/** \brief Offset for Ifx_GTM_CDTM_DTM_CH_CTRL2_SR_Bits.OC0_3_SR */
#define IFX_GTM_CDTM_DTM_CH_CTRL2_SR_OC0_3_SR_OFF (25u)

/** \brief Length for Ifx_GTM_CDTM_DTM_CH_CTRL2_SR_Bits.SL0_3_SR */
#define IFX_GTM_CDTM_DTM_CH_CTRL2_SR_SL0_3_SR_LEN (1u)

/** \brief Mask for Ifx_GTM_CDTM_DTM_CH_CTRL2_SR_Bits.SL0_3_SR */
#define IFX_GTM_CDTM_DTM_CH_CTRL2_SR_SL0_3_SR_MSK (0x1u)

/** \brief Offset for Ifx_GTM_CDTM_DTM_CH_CTRL2_SR_Bits.SL0_3_SR */
#define IFX_GTM_CDTM_DTM_CH_CTRL2_SR_SL0_3_SR_OFF (26u)

/** \brief Length for Ifx_GTM_CDTM_DTM_CH_CTRL2_SR_Bits.DT0_3_SR */
#define IFX_GTM_CDTM_DTM_CH_CTRL2_SR_DT0_3_SR_LEN (1u)

/** \brief Mask for Ifx_GTM_CDTM_DTM_CH_CTRL2_SR_Bits.DT0_3_SR */
#define IFX_GTM_CDTM_DTM_CH_CTRL2_SR_DT0_3_SR_MSK (0x1u)

/** \brief Offset for Ifx_GTM_CDTM_DTM_CH_CTRL2_SR_Bits.DT0_3_SR */
#define IFX_GTM_CDTM_DTM_CH_CTRL2_SR_DT0_3_SR_OFF (27u)

/** \brief Length for Ifx_GTM_CDTM_DTM_CH_CTRL2_SR_Bits.POL1_3_SR */
#define IFX_GTM_CDTM_DTM_CH_CTRL2_SR_POL1_3_SR_LEN (1u)

/** \brief Mask for Ifx_GTM_CDTM_DTM_CH_CTRL2_SR_Bits.POL1_3_SR */
#define IFX_GTM_CDTM_DTM_CH_CTRL2_SR_POL1_3_SR_MSK (0x1u)

/** \brief Offset for Ifx_GTM_CDTM_DTM_CH_CTRL2_SR_Bits.POL1_3_SR */
#define IFX_GTM_CDTM_DTM_CH_CTRL2_SR_POL1_3_SR_OFF (28u)

/** \brief Length for Ifx_GTM_CDTM_DTM_CH_CTRL2_SR_Bits.OC1_3_SR */
#define IFX_GTM_CDTM_DTM_CH_CTRL2_SR_OC1_3_SR_LEN (1u)

/** \brief Mask for Ifx_GTM_CDTM_DTM_CH_CTRL2_SR_Bits.OC1_3_SR */
#define IFX_GTM_CDTM_DTM_CH_CTRL2_SR_OC1_3_SR_MSK (0x1u)

/** \brief Offset for Ifx_GTM_CDTM_DTM_CH_CTRL2_SR_Bits.OC1_3_SR */
#define IFX_GTM_CDTM_DTM_CH_CTRL2_SR_OC1_3_SR_OFF (29u)

/** \brief Length for Ifx_GTM_CDTM_DTM_CH_CTRL2_SR_Bits.SL1_3_SR */
#define IFX_GTM_CDTM_DTM_CH_CTRL2_SR_SL1_3_SR_LEN (1u)

